Revit 2026 API

# WireGetMEPSystems Method

---

Gets the systems to which the wire belongs.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<ElementId> GetMEPSystems()
```
```vb
Public Function GetMEPSystems As IList(Of ElementId)
```
```cpp
public:
IList<ElementId^>^ GetMEPSystems()
```
```fsharp
member GetMEPSystems : unit -> IList<ElementId>
```

#### Return Value

IListElementId The systems to which the wire belongs.

One wire might belong to more than one circuit.

#### Reference

Wire Class

Autodesk.Revit.DB.Electrical Namespace